app/controllers/books_controller.rb

  def index
    @books = Book.all
    if params[:author].present?
      @books = @books.where(author: params[:author])
    end
    if params[:title].present?
      @books = @books.where(title: params[:title])
    end
    if params[:editorial].present?
      @books = @books.where(editorial: params[:editorial])
    end
    if params[:available].present?
      @books = @books.where(available: params[:available])
---
SELECT "books".* FROM "books"
SELECT "books".* FROM "books" WHERE "books"."editorial" = $1  [["editorial", "vc"]]
SELECT "books".* FROM "books" WHERE "books"."author" = $1 AND "books"."title" = $2 AND "books"."editorial" = $3 AND "books"."available" = $4  [["author", "vaca loca"], ["title", "vacas voladoras"], ["editorial", "vc"], ["available", true]]

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("title", "author", "editorial", "created_at", "updated_at", "available") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Sexto sentido"], ["author", "ss"], ["editorial", "ess"], ["created_at", "2023-09-14 01:45:24.535296"], ["updated_at", "2023-09-14 01:45:24.535296"], ["available", true]]

  def update
    begin
      book.update(book_params)
---
UPDATE "books" SET "title" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["title", "Vacas lola"], ["updated_at", "2023-09-14 02:21:26.120539"], ["id", 11]]

  def destroy
    begin
      book.destroy
---
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 6]]

  def book
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]