app/controllers/loans_controller.rb

SELECT "loans".* FROM "loans"
SELECT "loans".* FROM "loans" WHERE "loans"."user_id" = $1  [["user_id", 3]]
SELECT "loans".* FROM "loans" WHERE "loans"."user_id" = $1 AND "loans"."book_id" = $2  [["user_id", 4], ["book_id", 6]]
SELECT "loans".* FROM "loans" WHERE "loans"."user_id" = $1 AND "loans"."book_id" = $2 AND "loans"."returned" = $3  [["user_id", 4], ["book_id", 6], ["returned", true]]
---
  def index
    @loans = Loan.all
    if params[:user_id].present?
      @loans = @loans.where(user_id: params[:user_id])
    end
    if params[:book_id].present?
      @loans = @loans.where(book_id: params[:book_id])
    end
    if params[:returned].present?
      @loans = @loans.where(returned: params[:returned])

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "loans" ("user_id", "book_id", "returned", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["book_id", 6], ["returned", false], ["created_at", "2023-09-14 01:18:15.403787"], ["updated_at", "2023-09-14 01:18:15.403787"]]
UPDATE "books" SET "available" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["available", false], ["updated_at", "2023-09-14 01:28:56.699652"], ["id", 6]]
---
  def create
    loan_params["returned"] = false
    @loan = Loan.new(loan_params)
    @book = Book.find(params[:book_id])
    if @loan.save
      @book.update(available: false)

UPDATE "loans" SET "returned" = $1, "return_date" = $2, "updated_at" = $3 WHERE "loans"."id" = $4  [["returned", true], ["return_date", "2023-09-13 00:00:00"], ["updated_at", "2023-09-14 01:20:16.715530"], ["id", 38]]
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "books" SET "available" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["available", true], ["updated_at", "2023-09-14 02:12:28.293825"], ["id", 6]]
UPDATE "loans" SET "returned" = $1, "return_date" = $2, "updated_at" = $3 WHERE "loans"."id" = $4  [["returned", true], ["return_date", "2023-09-13 00:00:00"], ["updated_at", "2023-09-14 01:31:42.701384"], ["id", 39]]
---
  def return
    begin
      loan.update(returned: true, return_date: Date.today)
      @book = Book.find(loan.book_id)
      @book.update(available: true)

SELECT  "loans".* FROM "loans" WHERE "loans"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
---
  def loan
    @loan = Loan.find(params[:id])