app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."identification" = $1  [["identification", "DNI 18433557"]]
---
  def index
    @users = User.all
    if params[:identification].present?
      @users = @users.where(identification: params[:identification])

INSERT INTO "users" ("identification", "name", "address", "email", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "name" = $1, "identification" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "stefy"], ["identification", "s34650245"], ["updated_at", "2023-09-13 15:25:56.158211"], ["id", 2]]
---
  def update
    begin
      user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
  def destroy
    begin
      user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def user
    @user = User.find(params[:id])